// Forcing nextJS to render this component as client side component
'use client';

// Importing part
import {Dispatch, ReactNode, useState} from "react";
import BlogGenreHeaderComponent from "@/chunk/page/blog/blogGenreHeaderComponent";
import {Swiper, SwiperSlide} from 'swiper/react';
import SliderPaginationComponent from "@/chunk/sliderPaginationCompont";
import BlogComponent from "@/component/blogComponent";
import RandomImage from '@/public/img/blog/img-random.png';
import {Navigation} from "swiper/modules";
import 'swiper/css';

// Creating and exporting third section of blog page as default
export default function ThirdSectionComponent():ReactNode {
    // Defining states of component
    const [activeIndexOfSlider, setActiveIndexOfSlider]:[number, Dispatch<number>] = useState(0);

    // Returning JSX
    return (
        <section className="mt-[200px]">
            <div className="container p-[20px]">
                <BlogGenreHeaderComponent highlightedTitle={'داغ ترین'} nonHighlightedTitle="مقالات" link="#" />
                <main>
                    <Swiper
                        modules={[Navigation]}
                        initialSlide={activeIndexOfSlider}
                        spaceBetween={20}
                        onSlideChange={(event) => setActiveIndexOfSlider(event.activeIndex)}
                        navigation={{
                            nextEl: '#hot-blogs-next-slide-btn',
                            prevEl: '#hot-blogs-prev-slide-btn'
                        }}
                    >
                        <SwiperSlide>
                            <div className="grid grid-cols-3 gap-y-[32px] gap-x-[20px]">
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide>
                            <div className="grid grid-cols-3 gap-y-[32px] gap-x-[20px]">
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide>
                            <div className="grid grid-cols-3 gap-y-[32px] gap-x-[20px]">
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide>
                            <div className="grid grid-cols-3 gap-y-[32px] gap-x-[20px]">
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide>
                            <div className="grid grid-cols-3 gap-y-[32px] gap-x-[20px]">
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                                <BlogComponent date={new Date()} genre="دیجیتال" img={RandomImage.src} link="#" title="مدرن ترین سبک های طراحی در 2023">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است و چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد . </BlogComponent>
                            </div>
                        </SwiperSlide>
                    </Swiper>
                    <SliderPaginationComponent hasButtons nextBtnId="hot-blogs-next-slide-btn" prevBtnId="hot-blogs-prev-slide-btn" slidesPerView={1} slidesCount={5} activeIndex={activeIndexOfSlider} />
                </main>
            </div>
        </section>
    );
}